# shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `failure`
<details><summary>Show Plan</summary>
```terraform

module.common.module.cockroachdb_serverless_cluster.cockroach_cluster.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf]
module.common.module.kafka_serverless_cluster.upstash_kafka_cluster.default: Refreshing state... [id=upstash-cluster-27e7eccc-e91b-44a6-958d-269c5d74d6ec]
module.common.module.kafka_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=production-kafka-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.common.module.kafka_serverless_cluster.aws_ssm_parameter.default must be replaced
-/+ resource "aws_ssm_parameter" "default" {
      ~ arn            = "arn:aws:ssm:us-east-1:514472330244:parameter/production-kafka-cluster-id" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "production-kafka-cluster-id" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      ~ name           = "production-kafka-cluster-id" -> "production_kafka-cluster-id" # forces replacement
        tags           = {
            "environment"   = "production"
            "resource"      = "shared"
            "resource_type" = "kafka-cluster"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 2 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.common.module.kafka_serverless_cluster.upstash_kafka_cluster.default will be updated in-place
  ~ resource "upstash_kafka_cluster" "default" {
      ~ cluster_name            = "production-connectilly" -> "connectilly"
        id                      = "upstash-cluster-27e7eccc-e91b-44a6-958d-269c5d74d6ec"
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*